[
    "Cows have best friends and can become stressed when they are separated.",
    "Honey never spoils. It can last for centuries without going bad.",
    "A group of owls is called a parliament.",
    "Bananas are berries, but strawberries aren't.",
    "The Eiffel Tower can be 15 cm taller during the summer due to thermal expansion.",
    "The average person laughs about 15 times a day.",
    "A single cloud can weigh as much as 1 million pounds.",
    "Your taste buds have a lifespan of about 10 to 14 days.",
    "The longest recorded hiccuping lasted for 68 years!",
    "Bees can recognize human faces.",
    "The world's largest desert is Antarctica.",
    "A day on Venus is longer than a year on Venus.",
    "Butterflies taste with their feet.",
    "The dot over the letter 'i' is called a tittle.",
    "A group of flamingos is called a 'flamboyance.'",
    "The shortest war in history was between Britain and Zanzibar, lasting only 38 minutes.",
    "The smell of freshly-cut grass is actually a plant distress call.",
    "Elephants are the only animals that can't jump.",
    "There are more possible iterations of a game of chess than there are atoms in the observable universe.",
    "The world's oldest toy is a stick, according to archaeological finds.",
    "Octopuses have three hearts and blue blood.",
    "Wombat poop is cube-shaped.",
    "Scotland's national animal is the unicorn.",
    "Cats have fewer toes on their back paws.",
    "The first oranges weren’t orange; they were green.",
    "A single strand of spaghetti is called a 'spaghetto.'",
    "A rhinoceros' horn is made of hair.",
    "A shark is the only known fish that can blink with both eyes.",
    "Pineapples take about two years to grow.",
    "The M’s in M&M’s stand for 'Mars' and 'Murrie,' the founders of the candy.",
    "Sloths can take up to a month to digest a single leaf.",
    "A flea can jump up to 200 times its own height.",
    "There are more trees on Earth than stars in the Milky Way.",
    "The inventor of the frisbee was turned into a frisbee after he died.",
    "A 'jiffy' is an actual unit of time; it’s 1/100th of a second.",
    "The electric chair was invented by a dentist.",
    "Koalas sleep up to 22 hours a day.",
    "Some cats are allergic to humans."
]
